In [2]:
import pandas as pd

In [3]:
indata = 'https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv'

In [6]:
pd.read_csv(indata)

     age  gender  miles   debt  income  sales
0     28       0     23      0    4099    620
1     26       0     27      0    2677   1792
2     30       1     58  41576    6215  27754
3     26       1     25  43172    7626  28256
4     20       1     17   6979    8071   4438
..   ...     ...    ...    ...     ...    ...
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

[963 rows x 6 columns]

In [7]:
indata

'https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv'

In [9]:
indata = 'https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv1'
aa=[]
try :
    aa=pd.read_csv(indata)
except Exception as e:
    print(e)
    print(indata)

HTTP Error 404: Not Found
https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv1

In [11]:
pd.read_csv('../Ex.txt')

   이경율
0  이온유
1    딸
2   아빠

In [12]:
aa = pd.read_clipboard()

In [13]:
aa

   aa  bb  cc  dd  ee
0  12  33  44  55  66
1  33  44  55  66  77

In [15]:
bb = aa.rename(columns = {'aa':'kk'})

In [16]:
bb

   kk  bb  cc  dd  ee
0  12  33  44  55  66
1  33  44  55  66  77

In [17]:
CustomerData = 'https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/customer.csv'

In [18]:
indata = pd.read_csv(CustomerData)

In [19]:
indata.to_csv('./customerdata1.csv', index = True)

In [21]:
indata.to_csv('../customerdata2.csv', index = False)

In [23]:
data = pd.read_csv('../dataset/kopo_region_mst_hangul.csv', encoding = 'ms949')

In [24]:
data

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71        NaN
72      A99         기타

[73 rows x 2 columns]

In [25]:
data.columns = ['a','b']

In [26]:
data

      a      b
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

In [30]:
rename = data.rename(columns = {'a':'bb','b':'cc'})

In [32]:
rename

     bb     cc
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]